# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-mobilevits.yaml' will call yolo11-mobilevits.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs


# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]                           # 0
  - [-1, 1, MV2Block, [32, 1, 2]]                       # 1 stride,expansion
  - [-1, 1, MV2Block, [32, 2, 2]]                       # 2
  - [-1, 1, MV2Block, [64, 1, 2]]                       # 3
  - [-1, 1, MV2Block, [128, 1, 2]]                      # 4
  - [-1, 1, MV2Block, [128, 2, 2]]                      # 5
  # out_channel, kernel_size, patch_size, mlp_dim, depth, dim
  - [-1, 1, MobileViTBlock, [128, 3, [2,2],192, 2, 96]] # 6
  - [-1, 1, MV2Block, [256, 1, 2]]                      # 7
  - [-1, 1, MV2Block, [256, 2, 2]]                      # 8
  - [-1, 1, MobileViTBlock, [256, 3, [2,2],192, 4, 96]] # 9
  - [-1, 1, MV2Block, [256, 2, 2]]                      # 10
  - [-1, 1, MobileViTBlock, [256, 3, [2,2],192, 3, 96]] # 11
  - [-1, 1, SPPF, [1024, 5]]                            # 12
  - [-1, 2, C2PSA, [1024]]                              # out 13

# YOLO11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]   # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
