# Ultralytics YOLO 🚀 with DenseNet backbone
# YOLOv8 object detection model with DenseNet backbone and P3-P5 outputs.

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# DenseNet-based YOLOv8 backbone
backbone:
  # Initial convolution and pooling layer
  - [-1, 1, Conv, [64, 7, 2]]  # Initial Conv layer (7x7, stride 2)
  - [-1, 1, nn.MaxPool2d, [3, 2]]   # MaxPool layer (3x3, stride 2)

  # Dense Block 1
  - [-1, 6, DenseBlock, [64, 32, 4]]  # DenseBlock with 6 layers, growth rate 32
  - [-1, 1, DenseTransition, [128]]    # Transition layer (pooling + conv)

  # Dense Block 2
  - [-1, 12, DenseBlock, [128, 32, 4]] # DenseBlock with 12 layers, growth rate 32
  - [-1, 1, DenseTransition, [256]]    # Transition layer

  # Dense Block 3
  - [-1, 24, DenseBlock, [256, 32, 4]] # DenseBlock with 24 layers, growth rate 32
  - [-1, 1, DenseTransition, [512]]    # Transition layer

  # Dense Block 4
  - [-1, 16, DenseBlock, [512, 32, 4]] # DenseBlock with 16 layers, growth rate 32
  - [-1, 1, Conv, [1024, 1, 1]]        # Final Conv layer to match output channels

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [512, True]]  # Replace Conv with C2f for consistent YOLOv8 style
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 3, C2f, [256, True]]
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [512, True]]

  - [[7, 9, 11], 1, Detect, [nc]]
