# Ultralytics YOLO 🚀 with DenseNet backbone
# YOLOv8 object detection model with DenseNet backbone and P3-P5 outputs.

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# DenseNet-based YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Densenet121, [64, 0, "densenet_input"]]  # Input layer
  - [-1, 1, Densenet121, [256, 0, "densenet_layer"]]  # P2/4
  - [-1, 1, Densenet121, [128, 0, "densenet_transition_layer"]]
  - [-1, 1, Densenet121, [512, 1, "densenet_layer"]]  # P3/8
  - [-1, 1, Densenet121, [256, 1, "densenet_transition_layer"]]
  - [-1, 1, Densenet121, [1024, 2, "densenet_layer"]]  # P4/16
  - [-1, 1, Densenet121, [512, 2, "densenet_transition_layer"]]
  - [-1, 1, Densenet121, [1024, 3, "densenet_layer"]]  # P5/32
  - [-1, 1, SPPF, [1024, 5]]  # Spatial Pyramid Pooling layer

# YOLOv8 head with DenseNet
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # Head layer 1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # Head layer 2 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # Head layer 3 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # Head layer 4 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
