# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with EfficientNetB4 backbone

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone with EfficientNetB4
backbone:
  - [-1, 1, Conv, [32, 3, 2]]                  # 0
  - [-1, 1, MBConv, [24, 1, 3, 1, 1, 0, 32]]   # 1
  - [-1, 1, MBConv, [24, 1, 3, 1, 1, 1, 32]]   # 2
  - [-1, 1, MBConv, [32, 6, 3, 2, 1, 2, 32]]   # 3
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 3, 32]]   # 4
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 4, 32]]   # 5
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 5, 32]]   # 6
  - [-1, 1, MBConv, [56, 6, 5, 2, 1, 6, 32]]   # 7
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 7, 32]]   # 8
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 8, 32]]   # 9
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 9, 32]]   # 10
  - [-1, 1, MBConv, [112, 6, 3, 2, 1, 10, 32]] # 11
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 11, 32]] # 12
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 12, 32]] # 13
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 13, 32]] # 14
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 14, 32]] # 15
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 15, 32]] # 16
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 16, 32]] # 17
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 17, 32]] # 18
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 18, 32]] # 19
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 19, 32]] # 20
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 20, 32]] # 21
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 21, 32]] # 22
  - [-1, 1, MBConv, [272, 6, 5, 2, 1, 22, 32]] # 23
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 23, 32]] # 24
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 24, 32]] # 25
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 25, 32]] # 26
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 26, 32]] # 27
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 27, 32]] # 28
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 28, 32]] # 29
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 29, 32]] # 30
  - [-1, 1, MBConv, [448, 6, 3, 1, 1, 30, 32]] # 31
  - [-1, 1, MBConv, [448, 6, 3, 1, 1, 31, 32]] # 32
  - [-1, 1, SPPF, [512, 5]]                    # 33 (Reduced to 512 to match EfficientNet scaling)
  - [-1, 2, C2PSA, [512]]                      # 34 (C2PSA reduced to 512 for consistency)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 22], 1, Concat, [1]]   # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 37

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 10], 1, Concat, [1]]   # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 40 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 37], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]] # 43 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 34], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 46 (P5/32-large)

  - [[40, 43, 46], 1, Detect, [nc]] # Detect(P3, P4, P5)
