# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with Resnet50 backbone

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone with Resnet50
backbone:
  # [from, repeats, module, args]
  # ResNetLayer(args: input_channels, output_channels, stride, is_first:bool, n_blocks)
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]        # 0 P1/2 | output_size: 64, 160, 160
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]      # 1 P2/4 | output_size: 256, 160, 160
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]    # 2 P3/8 | output_size: 512, 80, 80
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]    # 3 P4/16 | output_size: 1024, 40, 40
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]   # 4 P5/32 | output_size: 2048, 20, 20
  - [-1, 1, SPPF, [2048, 5]]                         # 5 | output_size: 2048, 20, 20
  - [-1, 2, C2PSA, [2048]]                           # 6                                     

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]   # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]   # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 12 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]] # 15 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 18 (P5/32-large)

  - [[12, 15, 18], 1, Detect, [nc]] # Detect(P3, P4, P5)
